["It was as nailed-on that there would be a Swiss player in the men’s final of the 2017 Australian Open on Sunday as it was that an American would win the women’s title on Saturday. The odds that their combined ages would be at least 70 were a little tougher to see at the start of the fortnight but it crystallized into stunning reality here on the 11th day of a tournament that has had more twists than the Melbourne Grand Prix.", "A few hours after Serena Williams, 35, joined her 36-year-old sister, Venus, in the women’s final by trouncing the 34-year-old Mirjana Lucic-Baroni, Federer, 35, somehow conjured some more retro magic to beat Stan Wawrinka, a mere 31, for the 19th time in 22 matches. His bete noire, Rafael Nadal, plays Grigor Dimitrov, his young doppelganger, in the second semi-final on Friday.", "In so many ways, what Federer has done the past fortnight – and what he might do in his 100th match here, on Sunday – is beyond believable. When he forced a final weary shot out of his friend after a few ticks over three hours to win 7-5, 6-3, 1-6, 4-6, 6-3, Federer became the oldest man to reach the final of any major since Ken Rosewall at the 1974 US Open, when the Australian was 39. And the Swiss wizard has done it after six months off the Tour to recover from knee surgery. If he played on one leg, he could not amaze us much more.", "Federer took a medical timeout between the fourth and fifth sets and the faithful must have wondered if maybe he had come back too soon. When he returned to the court, he allayed their fears, battered Wawrinka and they rose to acclaim him as of old. They always believed he would.", "“I’ve had a leg thing going on for the week,” he said courtside. “I felt it from the second game of the match. I never take injury timeouts. I hope Stan wasn’t mad.” Wawrinka took one of his own, earlier. And he didn’t look too mad when they embraced at the net.", "He was pressed to be more specific about the injury. “If you go off the court, the treatment is further up the leg. It’s still the leg, right?” And that, of course, went down like the best joke of the year.", "He added: “I never, ever in my wildest dreams thought I’d be coming this far in Australia.” There were a few present who always held that dream close.", "Some people came to watch a tennis match on Thursday night. But it was easy to see why a lot of them were here for a religious experience, in adoration of the god they call Roger. It was as if the Rod Laver Arena was not big enough to house their devotion. He did not disappoint, although he did wobble.", "For a man who has the dress sense of your grandfather, he is to millions of tennis fans the coolest guy in sport. Just the coolest guy all round, really. He can do no wrong, even when he does, although he kept his unforced errors to a manageable 49. Novak Djokovic won a match here last year hitting a hundred of them.", "But Federer’s mistakes are mere accidents that spring from his daring. It does not require blind faith to appreciate the special player that he has been, still is, and, for as long as he chooses or until someone lets the tyres down on his wheelchair, will continue to be. It is not just that he plays and looks magnificent carving the air with his racket, going for the winning shot whenever it presents itself. He also brings a panoply of gifts to his sport that have little to do with tennis.", "Federer shakes more hands and hugs more babies than a politician – and what a good one he might make. Then again, diplomacy, correctness and an obsession with honesty have always underpinned his excellence, so maybe he would be a lousy one.", "Wawrinka is earthier and built of different material. Brad Gilbert calls him “the Stanimal” for a reason. On Thursday, he growled all the way to the end.", "Earlier they walked from the locker room together, Wawrinka a couple of yards and four years behind his compatriot, perhaps looking for the merest hint of physical slippage, but more likely lost in thought about his gameplan.", "How different things might have been, though. Before the match, the governor general, Peter Cosgrove, presented the nation’s highest honour, the Companion of the Order of Australia, to Rod Laver in his eponymous arena. He has a statue outside too. The old boy, who has lived in the United States for many years, remains immensely proud of the country he was born in 78 years ago and comes home as often as he can.", "If Federer’s parents had gone through with plans to emigrate to Australia when he was 13 the explosion of applause for him when he reached the 28th slam final of his career, and his sixth in Melbourne, would have been heard in Perth – Scotland, that is.", "There is, nevertheless, a lot of Australia in Federer. One of his earliest mentors was the South Australian Peter Carter, whose death in a 2002 car accident devastated him. His tears after winning here in the past have roots deeper than an attachment to victory.", "He has said more than once that he learned respect and a work ethic from Carter, whose family he seeks out on his annual visits. When he was going through a trough a few years ago, he joked that he had only got them tickets for the quarter-final as he was not sure he would progress much further.", "It is interesting to speculate what Federer the Australian would have become. As a precocious teenager, he was already moving – loudly and some times petulantly, it has to be said – towards a career in tennis. Might he also have tried cricket? He does like the game and almost certainly would have been a fine batsman. His maternal grandfather was a big noise in the Northern Transvaal Cricket Union.", "But Switzerland remained Roger’s home. It is also his haven. For years he lived in quiet, conservative Bottmingen in Basel-Land. In 2014, he and Mirka and their four children moved into a £6.5m mansion 70 miles away in Wollerau on the shores of Lake Zurich. Glass surrounds flood the residence with light, as if he did not generate enough himself.", "All of that was a long way from the battlefield in Melbourne. Federer had to fight harder than at any time since his return to subdue Wawrinka. When he dropped serve in the third set to go 1-4 down, it was the first time he had been broken since the second set against Mischa Zverev. When Wawrinka broke him again, anxiety spread in the congregation. When Stan served out the set to love, mild panic set in. Federer lost the fourth set too. The fans held their breath – then they voiced their wholesale delight when he slowly but inexorably worked his way to the finish line.", "Federer came from behind to beat Kei Nishikori in five sets in the fourth round. This was the 46th five-setter of his career, his second in four days. Wawrinka has played 45. One thing is certain. There will be one tired Swiss on court on Sunday."]["In perhaps the greatest and certainly least likely triumph of his career, Roger Federer defeated his nemesis Rafael Nadal in the Australian Open final, the Swiss clinching his 18th grand slam title and all but altering the space‑time continuum in a five-set classic at the Rod Laver Arena.", "With this breathtaking victory – 6-4, 3-6, 6-1, 3-6, 6-3 in three hours and 37 minutes – Federer becomes the first man to take five or more titles at three grand slam events and, at 35, the second-oldest man behind Ken Rosewall to win a major singles trophy. Only the appearance of a wooden racket could have made it more surreal.", "The fifth set was full of agonising drama and Federer weathered two break points to serve it out – but his ethereal grace could not be denied. Coming as it does a full five years after his 17th crown, the sight of the great champion’s tearful celebration was as pleasingly familiar as it was utterly astonishing. In future years he will surely look back on this ninth grand slam final meeting with his most fearsome opponent and wonder if it really happened.", "The early stages of the first set provided a familiar sight – both players trying to limit the damage wrought by the other’s forehand weaponry. Federer, only the No17 seed here, was as balletic and graceful as ever and it stayed on serve until the seventh game – Nadal’s fourth on serve – when Federer unfurled an unreturnable backhand and then an imperious forehand winner before achieving the first break.", "With economy of effort and an outswinging ace to seal it, Federer had taken the first set 6-4 in 34 minutes. Simply hanging in points had not been enough for Nadal. He trailed 13-5 for winners as the Swiss master went to work.", "By then the arena was packed with true believers but worship had not come cheap. A day earlier tickets were being hawked for up to A$16,000 (£9,630) – more than it cost to buy a house in Melbourne when the guest of honour, Rod Laver, won his last title and quite a premium on their original price range of A$413 to A$662 (£248-£398).", "Nadal needed to return with energy and hope for some untimely break in Federer’s effortless momentum in the second set. The two forces intersected to produce a pair of early break opportunities and the Spaniard struck. His battle to hold serve next up elevated the contest to fever pitch and Federer’s error count was steadily building.", "As in the third set of his semi-final win against Stan Wawrinka, Federer was suddenly a shadow of the player who had been commanding the contest moments earlier and quickly trailed 4-0. Unlike that previous match, he refused simply to write off the set entirely, breaking back once and giving Nadal hell in some barnstorming rallies before conceding it 6-3 in 42 minutes.", "Federer mixed howlers with howitzers in an awkward, 10-minute long hold of serve to start the third set, then just as quickly returned to his virtuoso earlier self. He unfurled a series of mesmerising forehand winners to secure an early break and wedge his foot in the door. Nadal was still stoic and mean but dropped the set 6-1. Federer had hit 18 winners to Nadal’s four and looked invincible once more.", "The No9 seed, though, was far from done. With a sizzling forehand winner down the line in the fourth game of the fourth set, he had three break points and took advantage. A sliced forehand winner to make it 4-1 in his favour bent logic and a tight angle to astound the Melbourne crowd. In 40 taut minutes Nadal had pushed it to a decider.", "The only surprise when Federer took a medical time-out before the fifth set was that neither battle-weary player had done so sooner. Hopping about energetically as he waited, Nadal was soon tucking into his opponent’s serve, whip-cracking a signature forehand winner on his way to an early break.", "Then Federer rallied again. His effort to break back and lock it up at 3-3 came after several moments of unbearable drama as Nadal, seemingly possessed, met almost every break point with a winner. Back on level terms, now it was Nadal showing fatigue as he sent an exhausted double fault into the middle before conceding the final, fatal break.", "Almost prostrate 30 minutes previously, Federer weathered a number of nerve-shredding moments in his final service game but after an unsuccessful challenge from his opponent, finally saluted. By that point you had started to wonder whether 16-grand seats were not a bargain after all.", "“I don’t think either of us believed we’d be in the finals,” Federer said afterwards before paying tribute to Nadal. “I’m happy for you. I would have been happy to lose, to be honest. The comeback was as perfect as it was.”", "Nadal said: “Today was a great match. Roger deserved it a bit more than me. I’m just going to keep trying. I feel I am back at a very high level, so I’m going to carry on fighting the whole season.”", "The pointy end of this tournament taught us that sometimes the fountain of youth is actually a mirage. When the favourites Novak Djokovic and Andy Murray stumbled to shock losses in week one, it really should have been a newer-generation top-10 player such as Milos Raonic, Kei Nishikori or Dominic Thiem seizing this moment – or more likely battled-hardened Stan Wawrinka. Yet none had it in him. None had this in him.", "All the while Federer and Nadal were essentially playing from memory but what temples of sporting genius their minds and bodies are. Nadal has beaten Federer so many times over the years some hesitate to call it a rivalry. Here the only shame, as ever, was the need to split them. Performing at this level in your prime is one thing; doing it as the lights dim is the mark of untouchable greatness."]["Roger Federer will compete for his 18th grand slam singles title after defeating countryman Stan Wawrinka in a gripping five-set Australian Open semi-final at Rod Laver Arena.", "The world No17 triumphed 7-5, 6-3, 1-6, 4-6, 6-3 across three hours and five minutes in Melbourne, keeping alive the dream he might meet arch-rival Rafael Nadal in a retro-flavoured final.", "Once these two players shared a quite convivial master-apprentice relationship, but not for some time. “The day came where he didn’t call me so much any more,” Federer noted in the lead-up to this encounter. He also figured nobody in the world bar Nadal knew his game better.", "Knowing is one thing, delivering is another. Two sets down and limping, Wawrinka looked done. But his minor genius is to look flushed and mildly flustered at all times, like a man struggling through his first gym session in months, when he’s actually as strong as an ox and resilient beyond expectation.", "“It was an awkward match. Always against Stan, it was always never going to be easy,” Federer said afterwards. “[I’m] super happy I was able to win another five-setter in a grand slam. I don’t know how many times I won two five-setters in a grand slam. Maybe never before. So this is big.”", "The first set provided 50 minutes of utterly compelling tennis, Wawrinka looking the dominant force whenever a rally built but Federer defending with such light-footed brilliance it was always going to be hard to split them. ", "In football the cliche is that the best defensive team will always beat the best attacking one, and Federer’s efforts to stay in points that looked doomed proved crucial in the first set. Typical was a defensive, half-volley backhand slice from mid-court early in proceedings, which had seemed a metre past him when he made contact.", "At 5-5 Wawrinka mustered a break point but was expertly manoeuvred from wing to wing and couldn’t retrieve a running forehand, so Federer held. It seemed inconceivable a tie-break would be avoided, but serving at 5-6 Wawrinka blinked, losing his barings for all of a minute and letting his opponent slip through the back door. On set point Federer pushed him wide on the forehand and the world No4 cannoned it into the net to concede.", "The second set hinged on Wawrinka’s third service game. Federer caressed a forehand winner to make it 30-0 and then found himself with two break points. Wawrinka saved one, then had Federer out-positioned in a rally, but advancing to mid-court he clattered a regulation backhand into the net and drew a mass intake of breath.", "Unable to break the offending racket by throwing it to the ground, Wawrinka calmly snapped it over his knee, as if to rid himself of its suddenly dark aura. It sat courtside as a reminder of the split-second errors that would define the result. With a clinical love service game Federer closed out the set in 31 minutes. ", "His head covered in a towel and wearing a pained expression, Wawrinka promptly left the arena for a medical time-out. Later he revealed his right knee had in fact troubled him for the past fortnight. “It’s been for sure an issue since the beginning of the tournament,” Wawrinka said. “Then again, it’s not an excuse at all.”", "The world No4 returned with his right knee bandaged at the start of the third set, his shoulders slouched and his spirit sagging, but far bigger trouble was brewing for Federer. The inexplicable happened in Federer’s second service game when he faded completely to cough up three break points. Wawrinka struck with the second, and made it a double break soon after. He took the set 6-1 in 26 minutes as Melburnians sat in stunned silence. It was like a perfectly executed burglary in a sleepy town.", "Wawrinka became far more obtrusive from there, breaking immediately in the fourth set by unfurling a wondrous cross-court backhand winner. Earlier in the match he’d been given the runaround. Now it was time to stand and deliver. But nor was the four-time champion done, breaking straight back from a heart-stopping rally.", "The heightened stakes and rising din elevated the contest. Even on one good leg Wawrinka was a menace. It had looked destined for a tie-break but in the ninth game, with a deft forehand passing shot, Wawrinka broke and ensured a fifth set – still ruddy-faced and downbeat in his manner but playing with genuine swagger as he sealed it in 38 minutes.", "Now it was Federer’s turn for medical treatment. Eight minutes on, wrapped in towels and trying to loosen fatigued limbs, Wawrinka looked none too pleased about the prospect of his body seizing up on him and burying his chances.", "Federer returned calm but the match went a little haywire. Wawrinka had a chance to break him in the fifth game of the decider but Federer dug in his heels, then broke serve himself after Wawrinka sent down an untimely double fault. The buffer proved insurmountable, and Federer triumphed with a polite pump of the fist and a quarter-smile suggesting a job half-done.", "“I know I will have a chance to win on Sunday now,” Federer said. “That’s a great position to be in. Regardless of who it’s going to be against, I think it’s going to be special either way. One is going to go for his first slam or it’s the epic battle with Rafa.”", "Wawrinka paid tribute to his compatriot’s late-career resurgence. “He’s (an) amazing player to watch and to see on the court,” he said. “He’s flying on the court. He’s playing amazing tennis. He’s the best player ever. He can do anything he wants on the court.”", "A confluence of events have aided this remarkable situation in which three players aged 35 or over have now qualified for their respective singles final, chief among them a spell of mild weather in Melbourne, and in the case of the men’s draw the early exit of the two most fancied contenders. ", "But you don’t stumble into a grand slam final. Federer forced his way in with brilliant tennis at the right time, just as sure as the Williams sisters did earlier in the day. That he’s hovered near the top echelon for so long after his absolute prime is a statistical marvel of course, but that is nothing on the thrill of it in the flesh."]["Amazingly, irresistibly, beguilingly Roger Federer is playing tennis, five months short of his 36th birthday, that, apart from minor adjustments for age, is virtually indistinguishable from that which held his rivals transfixed for most of his 20s. It hardly seems possible but it is happening.", "There were plenty of observers, one of them not far from this keyboard, who doubted Federer could break the long spell he endured without a major after beating Andy Murray at Wimbledon in 2012. True believers in the press pack were confined to a knot of shameless sycophants.", "It did not make sense that Federer could break the strengthening duopoly of Novak Djokovic and Andy Murray, even though the Swiss twice pushed the Serb close at Wimbledon, once in a classic final, in 2014. Rafael Nadal, too, from time to time was still in front of him. Federer resembled a fallen Hollywood star who kept auditioning for the same role while the greasepaint ran embarrassingly down his cheeks.", "But on Sunday evening, only a few hours after a chronically painful right elbow forced Djokovic to join Murray on the injured list and withdraw from the forthcoming Miami Open, the ageless Federer beat 31-year-old Stan Wawrinka to win the Indian Wells Open for a joint-record fifth time, 6-4, 7-5 in killing 34C heat over an hour and 20 minutes. It was as if he were rising again by sheer force of will.", "Religious miracles are oceans parting and the lame throwing away their sticks. In tennis the earthly equivalent is Federer taking six months out in 2016 to recover from knee surgery that might have spirited him into retirement and returning to win this year’s Australian Open by coming from 1-3 down in the fifth set of the final, against Nadal, one of the game’s brutal finishers.", "Not only has he broken his grand slam drought but he has blossomed like a cactus flower in the desert. Sunday’s victory in a tournament the organisers like to regard as the fifth major was short of that. These were best-of-three matches and there were five of them, not seven over a maximum of five sets, as in the majors. And Federer had a walkover against Nick Kyrgios in the quarter-finals. Still Federer, who held serve 37 times in a row to reach the final, did what he had to do. He was quick, sharp, smart, adventurous and merciless. He floated again and stung.", "Federer is 19 short of the career collection of tournament victories of Jimmy Connors, who played in physically less demanding times. Connors quit tennis at 40. Federer, who said recently he might also play on until he is that age, began the week at No10 in the world but thinks he has an outside chance of returning to the top of the rankings, maybe even by the end of the year. There is gathering evidence to support a contention that seemed preposterous only a few months ago.", "Murray, the world No1 since clambering over the worryingly brittle Djokovic towards the end of last season, is still favourite to hold his lead all the way to Wimbledon, where he will defend the title he won for the second time last summer. He said on Saturday he plans to be fit for the Monte Carlo Open, which starts on 16 April, although he made no mention of his commitment to Great Britain’s Davis Cup quarter-final against France in Rouen, which begins on 7 April.", "The Scot picked up his complaint during practice in Indian Wells – where he lost his opening match to the world No129, Vasek Posposil – but Djokovic’s predicament, arising from a long-term problem that first surfaced after the French Open last year, sounds more serious. There were moments in his defeat by Kyrgios when the Australian almost knocked the racket from his right hand with his power-serving; few could recall that happening often in the same match.", "Djokovic, unable to defend his Miami title and the points that go with it, risks sliding quickly away from Murray in the rankings unless he can regroup on the clay of Europe.", "That anxiety could further eat into his confidence, which was stratospheric at the start of 2016. “My doctor has strongly advised against play because my elbow injury, that I keep carrying on for months, got worse in the past week,” Djokovic announced on his Facebook page.", "“Sadly, I won’t be able to defend my title in Miami this week. Believe me, it is as shocking to me, as it is to you. I had [an] incredible run in Miami, I won there my first Masters tournament and started my campaign towards the top of the world rankings.", "“No wonder they say that in sport the biggest and most painful defeats come from injuries and not from opponents.” Federer might yet have a say in that."]["Thanks as always for following along with us. You can read the match report here or check out Kevin Mitchell’s comment below.", "“What can I say? This has been a fairytale week once again,” Federer says. “I came here for the first time 17 years ago. To be the champion again, I can’t tell you what it means to me.”", "“I would like to congratulate Roger,” a tearful Wawrinka says. “He’s laughing, he’s an asshole but it’s OK.”", "Fighting back tears, Wawrinka adds: “I’ve lost some tough ones against you, but when you played the final in Australia, I was your biggest fan. So congratulations on your comeback and congratulations on today.”", "Roger Federer’s dream season continues. He’s now beaten Wawrinka for the Indian Wells title to move to 13-1 on the year and 6-0 against oppoents in the top 10. That’s his best showing to start the year since 2004 when he went 18-0 and finished No1.", "Second set: Wawrinka 4-6, 5-7 Federer", "At 15-love, Wawrinka nets a shot from the baseline for 15-all. He sends Federer scampering from end to end on the next point with a series of angles shots before Federer errs, but Wawrinka misfires on the next point for 30-all and now Federer is within two points of the title. Federer is all over Wawrinka’s serve but Stan muscles his way back into the rally and wins the point for 40-30. But now Wawrinka sends a forehand from the baseline sailing for deuce. And now Wawrinka dumps a backhand into the net and Federer has a championship point! The crowd swells and then quiets. Wawrinka’s serve graces the netcord: let, first service. Then a fault. Fed jumpes on a second serve, sends Wawrinka scampering and closes out the point with a routine volley winner!", "Second set: *Wawrinka 4-6, 5-6 Federer (*denotes next server)", "At 30-love, Federer nets a backhand early in a baseline rally. Wawrinka then pounces on a second serve and forces Federer into an error from the baseline for 30-all. A chance here for Stan? Federer faults and he’ll have a big opportunity on a second serve at 30-all. But Federer dials in a service winner and wins the next point to hold for 6-5. Now Wawrinka will serve to force a tiebreak while Federer will try to break to win the title. ", "Second set: Wawrinka 4-6, 5-5 Federer* (*denotes next server)", "At 15-love, a lovely backhand winner followed by an ace makes it 40-love. That’s 10 consecutive points on Wawrinka’s serve. Federer answers with a forehand winner followed by a double fault which Wawrinka challenges unsuccessfully, but a service winner gives Stan the hold.", "Second set: *Wawrinka 4-6, 4-5 Federer (*denotes next server)", "Three quick points for Federer and followed by an angled winner off a serve-and-volley to cap a love hold in just over a minute. Now Wawrinka will serve to stay in the match.", "Second set: Wawrinka 4-6, 4-4 Federer* (*denotes next server)", "Wawrinka answers with an easy hold of his own. We’re moving right along here: 18 games played in just over one hour.", "Second set: *Wawrinka 4-6, 3-4 Federer (*denotes next server)", "Another routine service game for Federer. Both players are serving well, but the difference between the countrymen is on second-serve points. Federer is 23 of 30 on the first serve (77%) compared to 23 of 31 for Wawrinka (74%); but he’s 11 of 17 on second serve (65%) compared to 8 of 22 for Stan (36%).", "Second set: Wawrinka 4-6, 3-3 Federer* (*denotes next server)", "At 40-15, Wawrinka overcooks a forehand from the baseline. Then Federer hits a winner for deuce and suddenly the first Hugely Important Point of the match is upon us. A service break here would no doubt put Federer within touching distance of the title. Wawrinka alleviates the tension with a thunderous ace, then follows it up with a service winner for the crucial hold. ", "Second set: *Wawrinka 4-6, 2-3 Federer (*denotes next server)", "Wawrinka with a glimmer of a chance as Federer falls behind 15-30 after his first double fault of the match. But he rattles off two quick points before pushing Wawrinka nearly off the court with a blistering second serve and winning the point easily for the hold. So much for that. The break consolidated, Wawrinka will serve at 2-3.", "Second set: Wawrinka 4-6, 2-2 Federer* (*denotes next server)", "Wawrinka quickly falls behind love-30 and Federer has a half-chance here to move level. Wawrinka mistimes his approach but Federer dumps his passing shot into the net for 15-30. A gift for Stan as Federer had all the room in the world to set up triple break point. Nevertheless, Federer wins the next point and will have two looks at a break point. He needs only one, passing Wawrinka with a forehand for the break to get back on serve in the second.", "Second set: *Wawrinka 4-6, 2-1 Federer (*denotes next server)", "At love-15, a gorgeous touch volley winner by Federer, who is now 8-of-10 on net approaches (compared to 0-of-1 for Wawrinka). I mean, seriously.", "He then rattles off three quick points for a drama-free hold and he’s on the board in the second set. ", "Second set: Wawrinka 4-6, 2-0* Federer (*denotes next server)", "At 40-30, a backhand gets away from Wawrinka and Federer has taken it to deuce. What a crushing blow if Stan fails to consolidate the break here. A backhand winner by Federer paints the baseline and now he will have a chance to break right back. Wawrinka sends a shot from the baseline long and appears to have been broken ... but he challenges it and it was in! Deuce. Now another winner by Federer on a net approach and he’ll have a second look at a break point. A divine volley from Federer, but Wawrinka attacks Federer’s backhand on the next point and saves it for deuce. Federer goes for a cross-court forehand winner but misses by inches and Wawrinka wins the next point for the hard-won hold to back up the break. This is high-level stuff from two top operators, perhaps the two finest hard-court players in the sport at this moment in time.", "Second set: Wawrinka 4-6, *1-0 Federer (*denotes next server)", "What a start for Wawrinka, who wins the first three points on Federer’s serve and now has three break-point chances. At love-40, this is only the second break point that Federer has faced in the entire tournament. He saves the first, then the second when he wrong-foots Wawrinka from the baseline. But he sends a backhand from the baseline long and after 42 consecutive holds of serve at Indian Wells, Federer has finally been broken. What a recovery for Wawrinka after being broken to end the first set.", "First set: Wawrinka 4-6 Federer", "Federer wins a point to put Wawrinka in a love-15 hole, but Stan answers with an ace out wide – his third of the afternoon – for 15-all. Wawrinka hits a winner for 30-15, but Federer gets the best of a baseline rally for 30-all and he’s two points from the set. Interesting. Wawrinka appeared to hit an ace but opted not to challenge it. Wawrinka goes long on a running forehand from the baseline and Federer has his first break-point chance of the day – and it’s a set point. Then Wawrinka sends another forehand long from the baseline on the longest rally of the match and he’s broken to lose the first set!", "“It’s dumbfounding why Stan wouldn’t challenge that when he had three challenges left in such a huge moment,” Patrick McEnroe says in the booth, noting that Federer appeared to gesture that the ball was in. “Could it be that he has too much respect for Roger Federer?”", "First set: *Wawrinka 4-5 Federer (*denotes next server)", "Wawrinka gets it to 30-all for the first glimmer of hope on Federer’s serve, but it’s quickly denied as Federer wins two quick points. Now Wawrinka will serve to stay in the first set.", "First set: Wawrinka 4-4 Federer* (*denotes next server)", "At 15-love, Wawrinka delivers a beautifully placed flip lob on an approach to win a point. What a gorgeously wrought shot. He then rattles off two quick points for the love hold.", "First set: *Wawrinka 3-4 Federer (*denotes next server)", "Another love hold for Federer, who continues to push the lightning-quick pace. He’s lost only two points on his serve, none on his second serve.", "First set: Wawrinka 3-3 Federer* (*denotes next server)", "Another easy hold for Wawrinka, who’s dealing on his serve – albeit far better on the first serve (9 of 10) than second (3 of 8). ", "First set: *Wawrinka 2-3 Federer (*denotes next server)", "A third straight crisp service game for Federer, who’s now won 12 of 14 points on his serve. Five games in 12 minutes has set quite a pace for this final.", "First set: Wawrinka 2-2 Federer* (*denotes next server)", "A stress-free hold for Wawrinka, who survived that tricky end of the court serving into the setting sun with no apparent distress. He’s been made to work a bit harder on his service games but no moments of real danger yet.", "First set: *Wawrinka 1-2 Federer (*denotes next server)", "Another immaculate service game from Federer: a love hold in barely over a minute capped by his first ace of the match. He’s won eight of nine points on his serve and now the pressure is on Wawrinka once more.", "First set: Wawrinka 1-1 Federer* (*denotes next server)", "At 30-all, Wawrinka dials in a 134mph ace down the middle, then follows with a 137mph serve that Federer can’t return in play.", "First set: *Wawrinka 0-1 Federer (*denotes next server)", "A breeze of a service game for Federer, who sprints ahead to a 40-love lead after a serve-and-volley on the opening point. He loses a point on an unforced but closes it out on the next point. Two picturesque backhand winners in the game. Remember: he has not been broken yet in this tournament and has faced just one break point.", "The conditions on court: 94F with a 6mph breeze. Not much longer now.", "Federer has won the coin toss and elects to serve. The players are warming up now and should be under way within the next few minutes.", "The players have emerged from the tunnel and are on the court. Federer noted during the on-camera interview with ESPN’s Brad Gilbert that it’s only the second time he’s met Wawrinka in a final and he’s yet to beat his countryman at this stage of a tournament. That’s a generous way to cast his 19-3 advantage in the all-time head-to-head, but no less honest.", "Elena Vesnina has just finished off Svetlana Kuznetsova for the women’s title. On 8 February of last year, she was ranked No122. Tomorrow, she will move to a career-high No13.", "Federer and Wawrinka will be on court imminently and we’ll be under way shortly. At last!", "Here’s a look at the statistics for both Federer and Wawrinka at Indian Wells entering the final. (Stats in italics indicate tournament leader.)", "Wawrinka v Federer29 Aces 2961% (230 of 380) 1st-Serve Percentage 59% (129 of 226)73% (167 of 230) 1st-Serve Points Won 82% (106 of 129)59% (88 of 150) 2nd-Serve Points Won 64% (62 of 97)87% (53 of 61) Service Games Won 100% (37 of 37)67% (16 of 24) Break Points Saved 100% (1 of 1)34% (84 of 245) 1st-Serve Return Points Won 29% (40 of 137)50% (69 of 137) 2nd-Serve Return Points Won 52% (56 of 107)26% (15 of 58) Return Games Won 29% (11 of 38)31% (15 of 48) Break Points Converted 65% (11 of 17)", "Elena Vesnina has just taken the second set from Svetlana Kuznetsova to level the women’s final and force a decider. Which means we’re at least 40 minutes away from the men’s final. ", "Some more odds and ends, courtesy of the ATP’s crack media relations staff:", "Federer owns a 19-3 advantage in the head-to-head series with Wawrinka, including a commanding 14-0 edge on hard courts. He won their most recent meeting in a five-set Australian Open semi-final in January and their two previous meetings at Indian Wells in the 2011 quarters and 2013 fourth round. Wawrinka’s lone win over Federer in a final came in the 2014 Monte-Carlo Masters. ", "Three of the Big Four – all but Murray – have accounted for 12 of the past 13 Indian Wells title. The lone exception? When Ivan Ljubicic, who currently is Federer’s coach, won the title in 2010.", "Hello and welcome to the Indian Wells final between Stan Wawrinka and Roger Federer. Today’s all-Swiss showdown marks the first final between two countrymen at the Masters event since Andre Agassi defeated Pete Sampras in 2001.", "The third-seeded Wawrinka is playing in his first final at the Palm Springs tournament, while the ninth-seeded Federer enters the seventh final of his career here without having dropped a set or even lost a service game. This is the oldest combined final in tournament history between Federer (35yrs 7mos) and Wawrinka (31yrs 11mos) – and the winner will become the oldest champion in tournament history by surpassing Jimmy Connors, who was 31yrs, 5mos when he won here in 1984. ", "Bryan will be here shortly."]["Australia’s Nick Kyrgios beat the world No2 Novak Djokovic for the second time in as many weeks to reach the quarter-finals at Indian Wells, where he will face Roger Federer.", "The 21-year-old won his fourth round match 6-4, 7-6 (7-3) inside 110 minutes, with his serve again coming to the fore, as it did in Acapulco 12 days earlier, before veteran Federer saw off his longtime rival Rafael Nadal in straight sets, 6-2, 6-3, in a rerun of January’s Australian Open final.", "“It feels good. I knew what I had to do today,” Kyrgios said. “It was always going to be tough – he is a great champion.”", "Kyrgios put 25 aces past the 12-times grand slam champion in the Mexican Open quarter-finals and while he could not match that in California – he managed 14 – he still dominated to book a place in the last eight.", "Kyrgios hit 25 winners past Djokovic, who was unable to bring up a single break point chance against the world No16.", "Djokovic, champion at Indian Wells for the last three years, had previously been unbeaten in 20 matches in the Californian desert.", "“The run was amazing,” Djokovic said. “It had to end at some stage. Unfortunately, it was today.”", "The Serb had looked in good shape during his third-round victory over Juan Martín del Potro, when he roared through the final set playing what he described as his best tennis of the year.", "But he cut a frustrated figure against Kyrgios, who is looking to reach his third straight semi-final of the season.", "Another high-profile opponent awaits after Federer despatched Nadal in just over an hour, breaking four times to register his third straight victory over the Spaniard.", "Nadal holds a 23-13 lead in their all-time head-to-head results, but he was always playing catch-up in California after being broken in the match’s opening game. He wasted a break-back opportunity in the second game and from then on Federer never looked back.", "“The main thing is he [took] the break in the first game,” Nadal said. “When Roger has the advantage, his serve is so good. He has a lot of confidence with his serve – he’s able to play much more relaxed.”", "Federer will meet Kyrgios, who identifies the Swiss as one of his favourite players of all time, for just the second time. The Australian won their only encounter to date, in Madrid two years ago.", "“I am serving really well,” Kyrgios said. “That is creating chances for me to put pressure on their service games. My mentality is improving and I’m trying really hard to fight for every point and just compete.”"]["Not even the ageless Roger Federer was on the Tour when the Dubai championships began 25 years ago but the Swiss, newly decorated as a major champion after shaking up the tennis world in Melbourne, is happy to go into this week’s tournament as the hunted again.", "“I’ve had some great years here in Dubai,” Federer, an eight-times champion, said after a light beach-tennis workout with Andy Murray, whom he is scheduled to meet in the semi-finals if the results fall as they should. “I wanted to be in good shape and ready for the conditions, so I came early this year.”", "Murray lost against Federer in the final here five years ago but much has changed for them both since. The Scot, who roared to the top of the rankings as Novak Djokovic faltered on and off the court last year, is world No1 still, though he has had to recalibrate his game after a shock defeat against Mischa Zverev in the fourth round of the Australian Open, while Federer, rejuvenated after taking a six-month break to recover from knee surgery, is reborn at 35, the most unexpected star of 2017 so far.", "Murray, who says he has recovered from a minor bout of shingles, opens against the world No47, Malek Jaziri of Tunisia; Federer, seeded No3, has a trickier engagement against the elegant and adventurous Frenchman, Benoît Paire. Dan Evans has an interesting first‑round match against Dustin Brown.", "For all that the tone and atmosphere of the tournament – held in the city where Federer has a winter training base – is suitably relaxed, an ATP 500 event that matters but not so much that it invites trepidation, Federer desperately wants to beat this strong field. He will have to go through Murray and Stan Wawrinka, winner of three majors, to do it.", "He beat three top‑10 players, including Wawrinka, to win his 18th major in Melbourne but he suffered through most of the fortnight with a groin strain and came from 1-3 in the fifth set of the final against Rafael Nadal, a victory that might be remembered as the best of his career, given the context. Since then he has spent time with his family and resumed light training recently to ease back into the Tour without aggravating his injury.", "There was plenty of light-hearted banter in the lead-up, not the least of it when the players told the Tour’s website on the eve of the Oscars who they would like to play them on the big screen. “I have no idea who’d play me in a film ... Sean Connery?” Murray responded quizzically (having gone for Ewan McGregor last October). “Not sure if that works, really. There’s a slight age difference.”", "Wawrinka thought Leonardo DiCaprio could do a job; Tomas Berdych opted for Pierce Brosnan (or was it Piers Morgan?); Gaël Monfils chose Denzel Washington; Grigor Dimitrov went for Johnny Depp; Jo-Wilfried Tsonga and Nick Kyrgios said Will Smith; Djokovic, who has taken a wild card in Acapulco, could not decide between DiCaprio and Robert DeNiro; Kyle Edmund gave the gig to Tom Hardy.", "They did not ask Federer. There is every chance he would like a crack at the role himself. Everything else in his storied life has unfolded as if it were invented in some Hollywood scriptwriter’s office anyway."]["The Swiss player won a thrilling Australian Open final but would have been happy to ‘accept a draw’ against another wonderful ambassador for tennis", "Roger Federer’s claim to greatness has never been in question, not even in the five years since he won his 17th grand slam. However, his right to be regarded as peerless in the history of his sport was cemented beyond argument when he drew four majors clear of the 14 Rafael Nadal shares with Pete Sampras by defeating the Spaniard in an Australian Open final to rank alongside the best of the nine in which they have now contested a slam title.", "This was the 100th match the Swiss has played in Melbourne, his fifth Australian Open triumph and, while it was only his third victory in 12 slam matches against Nadal, his first in 10 years, the third in a final and his 12th overall in 35 contests, he elicited rapturous applause from the packed stands when he insisted that he would have been happy to “accept a draw” with his most enduring rival.", "For the rest of us, accepting such magnanimity ought to be tempered with the realisation that these wonderful players are ambassadors as much as champions. They invariably say what is expected of them. It was a generosity of spirit that Federer disguised brilliantly when burying Nadal in a fifth set that reached a pitch that hardly seemed possible even a few months ago and unlikely even earlier in the evening.", "Almost a year to the day since he wrenched his knee while running a bath for one of his four children and playing in his first proper tournament since surgery after losing against Milos Raonic in the semi-finals at Wimbledon six months ago, the 35-year-old somehow made a legend crack. “I can’t believe it,” Federer said. “It’s just incredible. I couldn’t be happier. I went so much further than I thought I would. I would have said a great event would have been quarters. Today I just drove myself forward, serve and run: fight and see if you get lucky. Tonight I got lucky.”", "Lucky? Only the freakishly powerful Ivo Karlovic hit more than Federer’s 108 aces for the fortnight. Only Kei Nishikori bettered his 21 winning returns off serve. His total of 402 clean winners placed him fourth among the 128 original entrants. He went to the net 242 times in seven matches and won the point 175 times – daring on a grand scale.", "John McEnroe’s verdict was unequivocal and got to the core of it: “Roger Federer is the greatest of all time.” That sentiment was hard to challenge after watching Federer win 6-4, 3-6, 6-1, 3-6, 6-3 against an opponent who invariably had a hold on him in big matches. On maybe the night of his biggest win, given the context and the history, Federer broke those chains.", "Just reaching the final was a victory for both of them and only partially facilitated by the early shock defeats of the two best players in the world, Andy Murray and Novak Djokovic. On Sunday, the two who stood at the top of the mountain, deservedly so, had a combined age of a pensionable 65.", "At the very instant Nadal – five years younger at 30 – served to start the match, just after 7.30pm local time with the sun drifting westward across the city rooftops and the temperature sliding slowly south, a distant tram bell tolled. We would not for whom for another three hours and 37 minutes.", "To echo Hemingway (and Donne, from whom the American borrowed the title), the triumph belonged not only to the victor here but to all of tennis. Both finalists have enriched the game through their personal skills and their rivalry. No man is an island, said the poet – and that holds true for champion athletes as well as doomed soldiers. They have made each other great.", "As recently as October, when Federer went to Majorca to give Nadal’s academy a publicity boost, neither was up to wielding a racket in earnest. Wounded to the point where they might fleetingly have contemplated leaving the battlefield, they fought on. And here they were, generating thrills like they had done since Nadal won their first encounter, in the first round in Miami 13 years ago.", "While it was slow to ignite, this was a final quick to burn as fiercely as any in recent memory. Whether through fear of physical collapse or inspired by their return to share the biggest stage here for the first time since 2009, both hit with vicious intent. Federer’s 73 winners may have been more pleasing on the eye but Nadal – whose wrist injury robbed him of two months last season – struck savagely, too. There were 184 rallies of fewer than four shots and 34 that went longer than nine – 10 of those in an epic final set that lasted just over an hour and during which Nadal saved nine of 11 break points before succumbing to Federer’s artful torture.", "For a quarter of an hour nothing much happened. The Spaniard held to love twice, as Federer explored his options at the net, and some ill-timed, techno music drifted in from a nearby festival to drown out the squawking of the seagulls. It was genteel, in a Melbourne sort of way. That would not last.", "The last hour and a half provided the most drama, as is nearly always the case in these circumstances. The pre-match consensus was that Nadal would be more dangerous over five sets – despite a much bigger workload during the fortnight – because Federer’s admission that he had aggravated a groin strain in defeating Stan Wawrinka in five sets on Thursday was a reminder of his vulnerability.", "Before they got into the trenches for the last time, Federer took a medical time‑out – as he did before getting the better of Wawrinka. Federer admitted then that he did it partly because his compatriot had taken a break earlier in the match and therefore felt justified in doing so. It worked again.", "At 0-2 down, Federer had the trainer on to rub his right thigh – but there was an entirely different sort of interlude when a ball kid had to clean up a deposit by a passing bird right on the service line as Nadal stepped up in the fourth game. Even seagulls are Federer fans.", "His competitive juices ran sufficiently hot for him to complain quietly to the chair umpire, James Keothavong, about what he perceived to be slow serving by Nadal.", "Federer began charging the net again; he won 29 of 40 visits, overall, nine of 12 in that desperate closer, as he broke back. Nadal’s timing went missing. The crowd went wild – especially when he struck an 89mph second-serve ace to hold to love and lead. “Superman is back,” McEnroe said.", "Nadal was up a break in the fifth set against Djokovic here in the 2012 final and blew it. He saved three break points in the seventh game but struck a post on the fourth. After three and a half hours, Federer served for the title.", "His 20th ace gave him a second championship point. A forehand clipped the line. Nadal challenged. It was good. They embraced. Federer jumped about like a kid, his face a picture of ecstasy – and the tears flowed again, as they had in defeat eight years ago.", "What a ride they have given us."]["It is the debate that pollutes a thousand friendships: is Roger Federer, who has won 17 majors, entitled to be regarded as the greatest player tennis has ever seen if he has lost 23 times in 34 matches to Rafael Nadal, who has won 14 slams? At Rod Laver Arena here on Sunday , we will have more evidence to pore over when they contest the final of a grand slam tournament for the 12th time.", "This is the final no one expected but nearly everyone wanted. A fortnight ago, nobody outside their immediate circles would have predicted that the title would be decided between the world No17 and the world No9 in a stretch of competition where Andy Murray and Novak Djokovic are so far ahead of the field that their nearest rival is Milos Raonic, the ailing Canadian who went out to Nadal in the quarter-finals.", "Nadal, who turns 31 during the French Open, and Federer, who will be 36 in August, are revisiting their rivalry partly because Denis Istomin, ranked 117 in the world, made the Spaniard’s job easier by eliminating Djokovic in the second round, then Mischa Zverev (ranked 50) shocked Murray in the fourth round on the other side of the draw. Those upstarts lost their next matches, but they had left their mark on the tournament in dramatic style.", "The old campaigners, meanwhile, worked their way through the draw with varying degrees of sweat and panache, Nadal surviving the most searching examination in the semi-finals when he took nearly five hours to beat the superb Grigor Dimitrov on Friday night. Federer’s semi-final against Stan Wawrinka also went five sets, but lasted about two hours less and was played a day earlier.", "Both were understandably tired by their efforts and, unusually, decided not to talk to the media on the day before the final. There was, though, one expert voice to provide perspective.", "Dimitrov, so similar in style to Federer (and a client of his agency, Team8), left the tournament a revivified presence on the Tour because he pushed Nadal so hard and the result was in doubt all the way to the final point.", "“He’s such a fighter, such a competitor,” the world No 15 said. “It was an honour for me to play a match like that against him. It also shows me that I’m in a good way, I’m on the right path. One thing I can say is that I left it all out on the court. It’s been super intense. He really shows why he’s [still] Rafa.”", "That could be a determining factor in the final because Nadal also had to give every last drop of sweat to get past him. He said he was exhausted, which was self-evident by his demeanour and his eagerness to leave the site and get some sleep.", "A lot of the elite players want no more to do with a tournament when they lose. They are just keen to get out of town and regroup. When Djokovic lost to Marin Cilic in the Paris Masters in November, he was asked if he would stay on to watch Murray as he bid to overtake him as world No1, he replied: “I’m planning definitely to stay another few days here with accreditation and watch all of his matches, yes ... and leave my son at home.”", "Dimitrov reacted differently. As disappointed as he was about falling just short, he said: “I’m going to watch it for sure. It’s super amazing. It’s great for the sport again.”", "So it is. For all that the game could do with some of the younger players breaking through to challenge Murray and Djokovic, there is an audience out there that relishes the return of Federer and Nadal. Theirs has been the rolling war that defined the first decade of the millennium. It seemed at one point it would last until they chose it not to.", "That was unrealistic. As great as they are, they are prisoners of time like all the others. But they have a chance here to remind us what we have been missing.", "If the groin strain Federer picked up against Wawrinka has eased sufficiently to allow him to move like he did when destroying Tomas Berdych, he could win it in four sets; if Nadal can carry the sheer animal grit he displayed against Dimitrov over the course of five sets, he should be too strong for his old friend. I suspect the latter will be the case.", "French Open, 2006, Nadal A 20-year-old Nadal became the first man to defeat Federer in a Grand Slam final. Federer dropped one set leading up to the final, while the Spaniard dropped two. Nadal won the match 1-6, 6-1, 6-4, 7-6 (7-4) to retain the title.", "Wimbledon, 2006, Federer The Swiss quickly took revenge, with the world No1 winning in four sets, 6-0, 7-6 (7-5), 6-7 (2-7), 6-3.", "French Open, 2007, Nadal Nadal denied Federer the hope of completing the set of Grand Slam titles as he won a third consecutive French Open, prevailing in four sets, 6-3, 4-6, 6-3, 6-4.", "Wimbledon, 2007, Federer History repeated itself as Federer again gained revenge for his French Open final defeat, winning 7-6 (9-7), 4-6, 7-6 (7‑3), 2-6, 6-2.", "French Open, 2008, Nadal Nadal thrashed the world No1 6-1, 6-3, 6-0 to become the seventh man to win a Grand Slam title without dropping a single set.", "Wimbledon, 2008, Nadal Federer had won the competition five years running but Nadal won his first Wimbledon title 6-4, 6-4, 6-7 (5-7), 6-7 (8-10), 9-7 in a thrilling four-hour 48-minute contest.", "Australian Open, 2009, Nadal Nadal took his tally to five Grand Slam final victories over Federer as he won his first Australian Open 7-5, 3-6, 7-6 (7-3), 3-6, 6-2.", "French Open, 2011, Federer Federer ended Novak Djokovic’s 43-match unbeaten run in the semi-final, but he lost the final 7-5, 7-6 (7-3), 5-7, 6-1."]["Roger Federer was at close to his imperious best as he swept aside Mischa Zverev in straight sets to set up a semi-final with Stan Wawrinka", "Here’s Kevin Mitchell’s report from Melbourne Park:", "Right, that’s it from me. Thanks for your company – be sure to join us again on Wednesday for the rest of the quarter-finals. And stick around on site for all the reports and reaction from day nine. But, from me, cheerio!", "Federer will face Stan Wawrinka in the semi-finals – his 13th trip to the last four in Melbourne in 14 years.", "Here’s Federer courtside with Jim Courier: “I thought I was maybe going to win a few rounds, maybe get to the fourth round, quarters, depending on the draw. Then when I saw the draw … I didn’t see a dream draw at all. I didn’t expect to play this well. ", "“Stan is a clutch player. He’s won a slam the last three years. I’ve just got to stay aggressive, the more time I give him the better he is.”", "Well, that was about as emphatic as you can get. Zverev momentarily looked in the match in the second set but in general he was utterly overwhelmed by Federer, who was imperious.", "Third set: Zverev 1-6, 5-7, 2-6 Federer* (*denotes server)", "An ace takes Federer to 30-0 in a flash but a fine Zverev return brings it back to 30-15 and Federer nets a forehand for 30-30. He follows that up by netting a routine volley. Zverev has an unlikely break point … and Federer crunches down an ace. Match point arrives presently and a forehand into the open court gives Federer victory.", "What the deuce?", "Federer about to serve for the match …", "Third set: *Zverev 1-6, 5-7, 2-5 Federer (*denotes server)", "Zverev sends down a couple of unreturnable serves to lead 40-15 but his second serve is letting him down and a gentle Federer backhand brings him back to 40-30 before a couple of straightforward passing shots – at least, he makes them look straightforward – give him a break point. Zverev twice volleys beautifully to save it though. But the German can’t get over the line and nets another volley to bring up a fifth deuce. Federer passes him to bring up a second break point … but an ace saves the day. ", "Deuce No6. He misses with a volley … break point No3. But another fine serve comes to the rescue again. Deuce No7. And then deuce No8. Break point No4 … but Federer goes a touch long. Deuce No9. Federer is almost inside the service box on Zverev’s second serve as he earns a fifth break point … but another ace booms down.", "Crikey. Deuce No10. Zverev nets a forehand volley. Break point No6 … and this time Federer backhands down the line for a double break. That game took about as long as the first set.", "Third set: Zverev 1-6, 5-7, 2-4 Federer* (*denotes server)", "Federer charges the net and Zverev dumps a dejected backhand to give the Swiss a 30-15 lead. And two points later Federer has the hold. Zverev looks truly broken now.", "Third set: *Zverev 1-6, 5-7, 2-3 Federer (*denotes server)", "Zverev goes 30-0 up but is again passed twice at the net – at times he looks like a man at a bus stop watching perplexed and stranded as the No91 zooms past him without stopping – as Federer brings us back to 30-30. Federer soon has a break point but Zverev scrambles to bring up deuce. ", "Zverev takes the advantage but then there’s probably the rally of the match, Federer brilliantly hitting two lobs, the first of which is hoiked back in by Zverev; the second, a dozen shots later, drops inside the line to give Federer the point. And that puts a bit of a pep into the Swiss – a fizzing cross court backhand gives him another break point, one he takes with a ludicrously good backhand down the line. Zverev, at the net on both occasions, can only watch on with admiration.", "Third set: Zverev 1-6, 5-7, 2-2 Federer* (*denotes server)", "Zverev makes a rare excursion to the net on the Federer serve and gets passed for his troubles. Another utterly straightforward hold.", "Third set: *Zverev 1-6, 5-7, 2-1 Federer (*denotes server)", "It’s all gone a little flat out on Rod Laver – the crowd have stopped believing in this as a contest, while Zverev has only sporadically suggested he believes in it himself. Federer brings up 30-30 with two passing shots as Zverev looks on helplessly at the net but a nice deep volley from the next points takes him to 40-30 and Federer goes long from the next.", "Third set: Zverev 1-6, 5-7, 1-1 Federer* (*denotes server)", "The most routine of routine holds for Federer.", "Third set: *Zverev 1-6, 5-7, 1-0 Federer (*denotes server)", "Deuce on the Zverev serve and a cracking passing shot gives Federer a break point. The world No50 saves it with a ferocious serve and a controlled volley. Another excellent volley gives him the advantage and a point later he has the hold. It’s far from straightforward for the German at the moment though.", "There’s just something in the way he moves isn’t there? Federer is almost exactly six months younger than your correspondent – I move like the Tin Man filled with concrete, he moves like some sort of sentient liquid.", "Second set: Zverev 1-6, 5-7 Federer* (*denotes server)", "A extraordinary, barely believable, cross-court forehand kisses the line to take Federer 30-0 up and within the blink of an eye he has two set points. A wonderful volley from the German keeps him in it at 40-30 but he follows that up with an errant return and Federer leads two sets to love.", "Second set: *Zverev 1-6, 5-6 Federer (*denotes server)", "This is exactly the point that you’d expect Federer to crank through the gears and he duly does so. At 0-15 Federer sends a return skidding onto Zverev’s toes and the big man can only dump the ball into the net. 0-30. And that soon becomes 0-40 as Federer gets the better of a close-quarters exchange at the net. Three break points. Federer needs just won, passing Zverev with ease as the German’s volley sits up to be hit. Federer will serve for the second set.", "Second set: Zverev 1-6, 5-5 Federer* (*denotes server)", "So Federer serves to stay in the second set. Zverev seems content to sit at the back of the court on the Federer serve now, tempting Federer to attack the net. Which he does without success on this occasion – Zverev leads 15-30. A weak return from the German allows Federer to go cross-court for 30-30 a long return makes it 40-30, and an ace gives Federer the hold.", "Second set: *Zverev 1-6, 5-4 Federer (*denotes server)", "At 30-0 Federer misses with the most routine of forehands and an ace brings Zverev a routine hold. The German is still on the back foot in the main but it’s chalk-and-cheese from the first set.", "Second set: Zverev 1-6, 4-4 Federer* (*denotes server)", "Federer cruises into a 30-0 lead but Zverev battles back to 30-30 with the help of his strangely punched forehand (he almost shovels the balls over the net rather than take a full swing). Again from that point though, Federer takes control.", "Second set: *Zverev 1-6, 4-3 Federer (*denotes server)", "Zverev booms down an ace to hold to 15.", "In other news, Andy Murray is not in the GB Davis Cup squad:", "Second set: Zverev 1-6, 3-3 Federer* (*denotes server)", "The points here are flying by so quickly it’s hard to keep up. Essentially the shape of the match is as follows – Zverev is at the net; if his approach shot is awkward for Federer then Zverev tends to win the point with a volley; if his approach shot is anything other than excellent then Federer wins with a passing shot or by sending a ferocious drive into the body of his opponent.", "Federer is also attacking the net on occasion – he does so at 30-0 but is beaten by a fine passing shot, then a long baseline rally – the longest of the match – ends with Federer netting a backhand. From 30-all, though, Federer steps on the accelerator again and holds with ease.", "Second set: *Zverev 1-6, 3-2 Federer (*denotes server)", "Federer earns two break points – he can’t beat Zverev with a lob from the first but hammers a backhand at the body of his opponent to take the second. We’re back on serve.", "Second set: Zverev 1-6, 3-1 Federer* (*denotes server)", "We have a match now! Zverev breaks to love. All of a sudden, Federer isn’t getting those easy passing opportunities and on the occasions when the Swiss comes to the net, Zverev is making life very awkward.", "Second set: *Zverev 1-6, 2-1 Federer (*denotes server)", "The point of the match comes at 30-0 with Zverev being peppered at the net by Federer but coping admirably and finally winning the point with his third successive volley. A hold to love.", "Second set: Zverev 1-6, 1-1 Federer* (*denotes server)", "This is better from Zverev, a cracking forehand down the line takes him 15-30 up on the Federer serve. But a couple of thumping Federer backhands help him back to 40-30 and the deepest of deep forehand just kisses the line to give Federer the hold.", "Second set: *Zverev 1-6, 1-0 Federer (*denotes server)", "Federer nets a forehand as Zverev finally finds a bit of venom in his serve and the German player has his nose ahead in the second set.", "“John, can we get some sort of longitudinal study up and running about sporting arena marriage proposals?” wonders Ian Nicol. “I have a feeling that divorce rates among those who marry after a very public proposal must be higher than the national average. There’s something very odd about the impulse to do it. Evidence sought!”", "I’d be surprised if there’s never been a study done on the “most successful” place for a marriage proposal. Who knows, maybe Rod Laver Arena has a 100% success rate for happy unions. The pool must be fairly small.", "First set: Zverev 1-6 Federer* (*denotes server)", "That game ends a run of 18 (at least) straight games for Federer against this opponent. Zverev digs in for 30-30 but another straightforward winner gives Federer his first set point … but he makes a rare error, straying wide on his forehand. An ace and a serve-volley of his own brings Federer the first set. It took just 19 minutes.", "First set: *Zverev 1-5 Federer (*denotes server)", "So the underdog can’t compete from the baseline and his serve-volley game is being completely undermined by Federer’s returning. He looked tentative from the off and now he looks shellshocked. Another volley off the frame at the net at least gives him a 15-0 lead this time and, after another Federer pass, an ace takes us to 30-15. Federer fails to return another booming serve but then a Zverev volley goes long – 40-30. But Federer goes long with his return from the next and Zverev is on the board.", "First set: Zverev 0-5 Federer* (*denotes server)", "Zverev already looks a beaten man. Federer holds to love.", "First set: *Zverev 0-4 Federer (*denotes server)", "Federer races into a 40-0 lead, with Zverev left helpless at the net by his opponent’s brilliant returning. The German’s second shot is continually a desperate pop into the middle of the court, giving Federer all the time he needs to find the passing shot or a lob. Another break to 15.", "First set: Zverev 0-3 Federer* (*denotes server)", "Zverev sprints into a 0-30 lead, courtesy of a slightly fortunate framed-volley at the net. Federer responds with an ace before charging the net himself and forcing Zverev to go long. The baseline rallies are complete one-way traffic – with Zverev pinned to the back of the court Federer rattles through another two points and holds once more.", "First set: *Zverev 0-2 Federer (*denotes server)", "A couple of successful serve-volleys take Zverev 30-0 up but he nets the next attempt and Federer passes him with a beautiful backhand to bring up 30-all before pinging a forehand cross court to bring a first break point. And Federer needs no second invitation, putting his return onto Zverev’s toes and then hammering another forehand cross-court past his opponent. An early break.", "First set: Zverev 0-1 Federer* (*denotes server)", "Zverev won the toss but opted to receive, interestingly. A couple of spot-on serves give Federer a 30-0 lead before Zverev dumps a backhand into the net. The German comes to the net at 40-0 down but Federer stings his racket with a forehand and it’s a straightforward hold for the Swiss.", "Right, warm-ups completed, off we go. Federer to serve.", "Out come the players. Zverev gets a warm round of applause, Federer receives a raucous reception.", "It looks like we’ve had a pre-match marriage proposal out on Rod Laver. She said yes. Sporting venues have never struck me as prime proposal territory, to be honest. But each to their own, I suppose.", "We’re about five minutes away from seeing the players on court at the Rod Laver Arena. The suspicion is we’ll see them walking off again about two hours later after a straightforward Federer victory. But you never know. ", "The bad news for Zverev: In the last 13 Australian Opens, Federer has reached 12 semi-finals. ", "And on both occasions these players have previously met, Federer has won in straight sets.", "And on the most recent of those occasions, in Halle in 2013, Federer was a 6-0, 6-0 winner.", "And the Swiss master has been in superb form in Melbourne, crushing Tomas Berdych in round three and coming through a thrilling five-setter with Kei Nishikori in the last 16.", "The good news? Well, this is already Zverev’s best run at a grand slam, eclipsing his run to the third round of Wimbledon in 2008. And he was brilliant against Murray.", "Hello all. Well, then. This was supposed to be Roger Federer v Andy Murray for a place in the Australian Open semi-finals. Mischa Zverev, though, put paid to that on Sunday with his shock victory over the world No1. The whole tournament is very much up for grabs now and no one will fancy their chances more than Federer.", "Also in the running is Stan Wawrinka, who beat Jo-Wilfried Tsonga earlier today and awaits the winner of Federer/Zverev in the semi-finals.", "In the women’s draw Venus Williams rolled back the years to oust Anastasia Pavlyuchenkova in straight sets. Coco Vandeweghe is also through to the last four after romping to victory over Garbiñe Muguruza. ", "John will be here shortly. In the meantime, read Kevin Mitchell’s preview of Johanna Konta versus Serena Williams. "]