{"response": {"currentPage": 2, "orderBy": "newest", "pageSize": 10, "pages": 14186, "results": [{"apiUrl": "https://content.guardianapis.com/football/blog/2017/mar/25/chelsea-stay-on-top-arsenal-miss-out-league-runin", "firPara": "When the Premier League returns after the international break it does so as if making up for lost momentum; a full midweek programme follows this coming weekends fixtures and by the time everyone has played twice in four or five days the remaining games will be down to single figures and the run-in will be under way.", "id": "football/blog/2017/mar/25/chelsea-stay-on-top-arsenal-miss-out-league-runin", "isHosted": false, "secPara": "Chelseas 10-point lead means they are universally regarded as a shoo-in for the title, though by that reckoning Arsenal have no chance of overhauling Tottenham, who are nine points ahead of their London rivals. While Arsenal have a game in hand, they also have a testing match coming up with the visit of Manchester City.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-25T13:46:00Z", "webTitle": "Arsenal and Manchester United likely to be crowded out by the top four | Paul Wilson", "webUrl": "https://www.theguardian.com/football/blog/2017/mar/25/chelsea-stay-on-top-arsenal-miss-out-league-runin", "wordCnt": 1012}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/25/becchetti-bates-venkys-10-awful-owners-football-clubs-leyton-orient", "firPara": "Leyton Orient fans believe their owner is leading them to oblivion but Hicks and Gillett, and Peter Ridsdale at Leeds remind us feckless owners are nothing new", "id": "football/2017/mar/25/becchetti-bates-venkys-10-awful-owners-football-clubs-leyton-orient", "isHosted": false, "secPara": " In just two and a half seasons as owner, the waste-management magnate has taken Leyton Orient from the verge of the Championship to the brink of relegation from the Football League and possibly even extinction. Since buying the club from Barry Hearn for £4m, the Italian has overseen nine managerial changes and faced repeated claims of interference in team affairs. In December 2015, he earned himself a six-match ban for kicking Orients then assistant manager, Andy Hessenthaler, following a win over Portsmouth. Last week, Orient survived a winding-up order at the high court and Becchetti was given until 12 June to either sell the club or pay off its debts. Waltham Forest council are among the creditors, for providing health and safety advice, as is the company that provides match-day stewards and the official club photographer. If Becchetti fails to either pay or sell up, Orient – bottom of League Two and seven points off the last safe spot – risk going into liquidation and out of existence.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-25T12:02:00Z", "webTitle": "Rogues’ gallery: English football’s worst owners, from Becchetti to Bates | Barry Glendenning", "webUrl": "https://www.theguardian.com/football/2017/mar/25/becchetti-bates-venkys-10-awful-owners-football-clubs-leyton-orient", "wordCnt": 1722}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/25/serbian-football-racism-problem-everton-luiz", "firPara": "FK Rads home stadium in the Belgrade suburb of Banjica is a strange, two-sided venue that comes to life whenever Crvena Zvezda or Partizan make the simple mile-long journey south for a derby in the Superliga. In March 2009 a visit for a match against the former had largely been spent ducking firecrackers thrown between the rival supports when, around an hour in, the tone shifted from tense to sinister.", "id": "football/2017/mar/25/serbian-football-racism-problem-everton-luiz", "isHosted": false, "secPara": "As the away side readied the dreadlocked Brazilian substitute Jeff Silva the projectile sparring stopped and the sound that replaced it, once experienced, does not fade easily from the memory. Silvas introduction was being greeted by monkey noises from a sizeable minority of the home support and the shock to these naive ears cannot be registered on the same scale as the impact on the player who, just for a second or two, turned round and stared the bank of offenders down.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-25T12:00:01Z", "webTitle": "Serbian football’s eye-watering racism problem shows no sign of abating", "webUrl": "https://www.theguardian.com/football/2017/mar/25/serbian-football-racism-problem-everton-luiz", "wordCnt": 1178}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/24/clint-dempsey-usa-honduras-world-cup-qualifying", "firPara": "A Clint Dempsey hat-trick and a scintillating playmaking performance from Christian Pulisic got the second Bruce Arena era off to a spectacular start, as the USA swept Honduras aside with an emphatic 6-0 win in San Jose.", "id": "football/2017/mar/24/clint-dempsey-usa-honduras-world-cup-qualifying", "isHosted": false, "secPara": "On a cold and damp night at the Avaya Stadium, the US not only gained their first points of the Hex round of World Cup qualifying, but jumped over both Trinidad &amp; Tobago and Honduras in the standings, thanks to the goal difference swing from their victory. They now travel to Panama on Tuesday night hoping to complete their climb back into the automatic qualification slots, and out of crisis mode.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-25T05:23:07Z", "webTitle": "Clint Dempsey and Christian Pulisic lead the way as USA trounce sorry Honduras", "webUrl": "https://www.theguardian.com/football/2017/mar/24/clint-dempsey-usa-honduras-world-cup-qualifying", "wordCnt": 852}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/25/seamus-coleman-martin-oneill-republic-of-ireland-everton", "firPara": "• Republic of Ireland and Everton full-back injured in draw• Wales coach Chris Coleman defends ‘devastated Neil Taylor", "id": "football/2017/mar/25/seamus-coleman-martin-oneill-republic-of-ireland-everton", "isHosted": false, "secPara": "• Republic of Ireland and Everton full-back injured in draw• Wales coach Chris Coleman defends ‘devastated Neil Taylor", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-25T00:20:49Z", "webTitle": "Séamus Coleman’s leg break a huge blow to club and country, says Martin O’Neill", "webUrl": "https://www.theguardian.com/football/2017/mar/25/seamus-coleman-martin-oneill-republic-of-ireland-everton", "wordCnt": 429}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/24/joe-hart-england-captain", "firPara": "A few days on from Englands defeat to Germany and positivity continues to surround Project Southgate. The result was not what the manager wanted in his first game in full-time charge but the performance was undeniably encouraging. There was poise and panache from those in blue, with the only ingredient lacking – albeit, a key one – a ruthlessness in front of goal.", "id": "football/2017/mar/24/joe-hart-england-captain", "isHosted": false, "secPara": "It would be unwise to get too carried away – this is England after all and Germany were uncharacteristically poor until Lukas Podolski scored with a rocket of a shot in his farewell game for the world champions. Nevertheless before Sundays World Cup qualifier against Lithuania at Wembley, there is cause for quiet optimism about a team that includes figures of recent, crushing failure – six of the players who started in Dortmund also did so against Iceland in Nice nine months ago – but looks somewhat refreshed.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-24T22:30:45Z", "webTitle": "Joe Hart becomes an old England head and looks to instil calm", "webUrl": "https://www.theguardian.com/football/2017/mar/24/joe-hart-england-captain", "wordCnt": 1159}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/24/republic-ireland-wales-world-cup-qualifier-match-report", "firPara": "The defining image of the evening was a horrible one as Séamus Coleman left the field on a stretcher, holding an oxygen mask and with his right leg broken. It was an awful tackle from Neil Taylor that left Coleman pointing to his leg in despair and there were some horrifying pictures of the damage that was inflicted. Taylor received a red card and Coleman was taken straight to hospital.", "id": "football/2017/mar/24/republic-ireland-wales-world-cup-qualifier-match-report", "isHosted": false, "secPara": "That moment overshadowed everything else and will come as a huge blow to Everton as well as the Republic of Ireland. Martin ONeill, the Ireland manager, talked afterwards about a player who had been having the season of a lifetime at club level and expressed his hope that Coleman would be able to fight back.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-24T21:53:31Z", "webTitle": "Séamus Coleman broken leg sours Republic of Ireland draw with Wales", "webUrl": "https://www.theguardian.com/football/2017/mar/24/republic-ireland-wales-world-cup-qualifier-match-report", "wordCnt": 865}, {"apiUrl": "https://content.guardianapis.com/football/live/2017/mar/24/republic-of-ireland-v-wales-world-cup-2018-qualifier-live", "firPara": "Ireland and Wales drew 0-0 in Dublin, but Seamus Coleman suffered a horrible injury after a challenge by Neil Taylor, who was sent off", "id": "football/live/2017/mar/24/republic-of-ireland-v-wales-world-cup-2018-qualifier-live", "isHosted": false, "secPara": "And with that, we shall bring this whole sorry business to an end. Thanks for reading, and good night. Be safe out there. ", "sectionId": "football", "sectionName": "Football", "type": "liveblog", "webPublicationDate": "2017-03-24T21:49:20Z", "webTitle": "Republic of Ireland 0-0 Wales: World Cup 2018 qualifier – as it happened", "webUrl": "https://www.theguardian.com/football/live/2017/mar/24/republic-of-ireland-v-wales-world-cup-2018-qualifier-live", "wordCnt": 1720}, {"apiUrl": "https://content.guardianapis.com/football/blog/2017/mar/24/eden-hazard-ngolo-kante-barney-ronay", "firPara": "There are some things in sport that youre just not allowed to say, lines that must not be crossed. For a long time it was more or less impossible to say in public that you thought Paul Scholes was simply a very good footballer, as opposed to a chasteningly complete distillation of perfection and a one-man anti-glam debunking of the Premier League star system. You might think this. But saying it out loud is still technically an offence under the Scholes Act 2009, punishable by being stabbed in the eye with a skewer by the Queen.", "id": "football/blog/2017/mar/24/eden-hazard-ngolo-kante-barney-ronay", "isHosted": false, "secPara": "The same goes for Sachin Tendulkar, the most astonishingly hyped player in the history of cricket, a very good, enduring batsman whose po-faced messianic persona conferred a kind of devotional light on his fine strokeplay and solid defence. To point out that, actually, youd rather watch Virender Sehwag is to admit not just to idiocy but to heresy, punishable by being publicly garrotted with a piece of twine by a group of sad, betrayed children. These are, of course, inappropriate opinions and anyone who holds them should be ashamed.", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-24T18:03:56Z", "webTitle": "Why Eden Hazard eclipses the N’Golo Kanté cult and is player of the year | Barney Ronay", "webUrl": "https://www.theguardian.com/football/blog/2017/mar/24/eden-hazard-ngolo-kante-barney-ronay", "wordCnt": 1115}, {"apiUrl": "https://content.guardianapis.com/football/2017/mar/24/the-fiver-england-lithuania-republic-o-ireland-wales-world-cup-qualifiers", "firPara": "In todays Fiver World Cup qualifiers, Mickey Mouse football and more", "id": "football/2017/mar/24/the-fiver-england-lithuania-republic-o-ireland-wales-world-cup-qualifiers", "isHosted": false, "secPara": "In todays Fiver World Cup qualifiers, Mickey Mouse football and more", "sectionId": "football", "sectionName": "Football", "type": "article", "webPublicationDate": "2017-03-24T16:42:24Z", "webTitle": "The Fiver | Shirtless, oiled and with a cross of St George painted across his face", "webUrl": "https://www.theguardian.com/football/2017/mar/24/the-fiver-england-lithuania-republic-o-ireland-wales-world-cup-qualifiers", "wordCnt": 1590}], "startIndex": 11, "status": "ok", "total": 141855, "userTier": "developer"}}